Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G51C.tmx
Source language: en_us
Languages: zh_cn

source: Jack Welch 18
zh_cn: 杰克韦尔奇自传18

source: While she could be strict, she could also be a real "softie."
zh_cn: 她既有严厉的一面，同时也真的是一个感性的人。

source: Once, when I was not much more than 11 years old, I stole a ball from a carnival that came through town. You know, the type of lousy ball you throw to knock metal milk bottles off a pedestal to win a Kewpie doll.
zh_cn: 有一次，大约我11岁的样子，我们这儿举办一次嘉年华，我偷了一个皮球，就是那种常见的游戏—把球顺利扔进桶底就可以得到小洋娃娃奖励—使用的脏兮兮的皮球。

source: It didn't take long before my mother found the ball and asked me where I got it.
zh_cn: 妈妈很快地发现了这个皮球并且问我哪儿来的。

source: When I admitted that I had stolen it, she insisted that I go to Father Cronin, return the ball to him, and then confess what I did.
zh_cn: 当我承认是偷来的，她便坚持要我去交给科林神父，忏悔我的行为。

source: Since all the priests knew me as an altar boy, I was convinced that they'd recognize me in the confessional the second I opened my mouth. I was scared of them.
zh_cn: 我知道因为我是圣童，所有的神父都认识我，到了告解室，只要我一开口，他们就知道是我了，我感到非常害怕。

source: Another time, when I was a senior in high school, I was caddying for one of the stingiest members of the Kernwood Country Club.
zh_cn: 还有一次，我上高中，给Kernwood乡村俱乐部最吝啬的会员之一做球童。

source: By that time, I had been a caddy there for eight years-which was probably a little long for my own good.
zh_cn: 此时我已经做球童已经八年，对我来说已经太久了。

source: We got to the sixth hole, a tee where the drive had to go only about a hundred yards to carry the pond.
zh_cn: 我们打到第六洞，是一个T字形，高尔夫球车得跑一百码去到池塘边。

source: This day, my guy topped his ball straight into the water.
zh_cn: 那天，这个吝啬鬼将球打到水里去了。

source: It landed at least ten feet into the muddy pond.
zh_cn: 它漂在脏脏的池塘中，离岸边至少十码。

source: He asked me to take my shoes and socks off and wade into the pond after his ball.
zh_cn: 吝啬鬼要我脱了鞋袜下手去捞回他的高尔夫球。

source: I refused, and when he insisted I told him to go to bell. I tossed his clubs into the water, told him to get his ball and clubs himself, and ran off the course.
zh_cn: 我拒绝了，当他一再无理要求我去时，我直接将他的球杆也扔进水里，叫他去死吧，自个儿去拣他的球杆和高尔夫球吧，我自己跑出了球场。

source: It was a stupid thing to do, even worse than flinging my hockey stick across the ice.
zh_cn: 这是件愚蠢的事情，比我在冰场上扔曲棍球棒扔严重多了。

source: Even though my mother was disappointed, because this incident cost me the club's caddy scholarship, she seemed to understand what I felt and didn't make as much of a big deal out of it as she might have.
zh_cn: 我因此而丢了球童的资格，妈妈虽然很失望，但是她好像也理解我的感受，并没有像往常一样将这作为一件大过错处罚我。
